tiborsimon/embedded-tdd-headers/pic/8bit/pic18f96j65_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F96J65_H_
#define _PIC18F96J65_H_

#define MISTAT                        0
#define BUSY                          1
#define SCAN                          2
#define NVALID                        3
#define EFLOCON                       4
#define FCEN0                         5
#define FCEN1                         6
#define FULDPXS                       7
#define MACON1                        8
#define MARXEN                        9
#define PASSALL                       10
#define RXPAUS                        11
#define TXPAUS                        12
#define MACON3                        13
#define FULDPX                        14
#define FRMLNEN                       15
#define HFRMEN                        16
#define PHDREN                        17
#define TXCRCEN                       18
#define PADCFG0                       19
#define PADCFG                        20
#define PADCFG1                       21
#define PADCFG2                       22
#define MACON4                        23
#define DEFER                         24
#define MABBIPG                       25
#define BBIPG0                        26
#define BBIPG1                        27
#define BBIPG2                        28
#define BBIPG3                        29
#define BBIPG4                        30
#define BBIPG5                        31
#define BBIPG6                        32
#define MICMD                         33
#define MIIRD                         34
#define MIISCAN                       35
#define ERXFCON                       36
#define BCEN                          37
#define MCEN                          38
#define HTEN                          39
#define MPEN                          40
#define PMEN                          41
#define CRCEN                         42
#define ANDOR                         43
#define UCEN                          44
#define EIE                           45
#define RXERIE                        46
#define TXERIE                        47
#define EIE_TXIE                      48
#define ETXIE                         49
#define LINKIE                        50
#define DMAIE                         51
#define PKTIE                         52
#define ESTAT                         53
#define PHYRDY                        54
#define TXABRT                        55
#define RXBUSY                        56
#define BUFER                         57
#define ECON2                         58
#define ETHEN                         59
#define PKTDEC                        60
#define AUTOINC                       61
#define EIR                           62
#define RXERIF                        63
#define TXERIF                        64
#define EIR_TXIF                      65
#define ETXIF                         66
#define LINKIF                        67
#define DMAIF                         68
#define PKTIF                         69
#define EDATA                         70
#define EDATA0                        71
#define EDATA1                        72
#define EDATA2                        73
#define EDATA3                        74
#define EDATA4                        75
#define EDATA5                        76
#define EDATA6                        77
#define EDATA7                        78
#define SSP2CON2                      79
#define SEN2                          80
#define SSP2CON2_SEN                  81
#define ADMSK12                       82
#define SSP2CON2_ADMSK                83
#define SSP2CON2_RSEN                 84
#define RSEN2                         85
#define SSP2CON2_ADMSK1               86
#define ADMSK22                       87
#define PEN2                          88
#define SSP2CON2_PEN                  89
#define SSP2CON2_ADMSK2               90
#define ADMSK32                       91
#define SSP2CON2_RCEN                 92
#define RCEN2                         93
#define SSP2CON2_ADMSK3               94
#define ACKEN2                        95
#define ADMSK42                       96
#define SSP2CON2_ADMSK4               97
#define SSP2CON2_ACKEN                98
#define ACKDT2                        99
#define ADMSK52                       100
#define SSP2CON2_ACKDT                101
#define SSP2CON2_ADMSK5               102
#define SSP2CON2_ACKSTAT              103
#define ACKSTAT2                      104
#define SSP2CON2_GCEN                 105
#define GCEN2                         106
#define SSP2CON1                      107
#define SSP2CON1_SSPM                 108
#define SSP2CON1_SSPM0                109
#define SSPM02                        110
#define SSPM12                        111
#define SSP2CON1_SSPM1                112
#define SSP2CON1_SSPM2                113
#define SSPM22                        114
#define SSPM32                        115
#define SSP2CON1_SSPM3                116
#define SSP2CON1_CKP                  117
#define CKP2                          118
#define SSPEN2                        119
#define SSP2CON1_SSPEN                120
#define SSPOV2                        121
#define SSP2CON1_SSPOV                122
#define WCOL2                         123
#define SSP2CON1_WCOL                 124
#define SSP2STAT                      125
#define SSP2STAT_BF                   126
#define BF2                           127
#define SSP2STAT_UA                   128
#define UA2                           129
#define SSP2STAT_R_W                  130
#define RW2                           131
#define SSP2STAT_R                    132
#define SSP2STAT_nWRITE               133
#define SSP2STAT_nW                   134
#define READ_WRITE2                   135
#define nW2                           136
#define SSP2STAT_I2C_READ             137
#define I2C_READ2                     138
#define SSP2STAT_R_NOT_W              139
#define R_nW2                         140
#define SSP2STAT_READ_WRITE           141
#define nWRITE2                       142
#define R_W2                          143
#define SSP2STAT_R_nW                 144
#define SSP2STAT_NOT_WRITE            145
#define SSP2STAT_S                    146
#define S2                            147
#define START2                        148
#define SSP2STAT_I2C_START            149
#define I2C_START2                    150
#define STOP2                         151
#define SSP2STAT_I2C_STOP             152
#define SSP2STAT_P                    153
#define P2                            154
#define I2C_STOP2                     155
#define I2C_DAT2                      156
#define SSP2STAT_D                    157
#define DATA_ADDRESS2                 158
#define SSP2STAT_D_NOT_A              159
#define SSP2STAT_I2C_DAT              160
#define D_A2                          161
#define SSP2STAT_NOT_ADDRESS          162
#define SSP2STAT_D_nA                 163
#define SSP2STAT_DATA_ADDRESS         164
#define SSP2STAT_nADDRESS             165
#define nA2                           166
#define DA2                           167
#define nADDRESS2                     168
#define SSP2STAT_nA                   169
#define SSP2STAT_D_A                  170
#define D_nA2                         171
#define SSP2STAT_CKE                  172
#define CKE2                          173
#define SSP2STAT_SMP                  174
#define SMP2                          175
#define SSP2ADD                       176
#define MSK02                         177
#define MSK12                         178
#define MSK22                         179
#define MSK32                         180
#define MSK42                         181
#define MSK52                         182
#define MSK62                         183
#define MSK72                         184
#define ECCP2DEL                      185
#define P2DC0                         186
#define ECCP2DEL_PDC0                 187
#define ECCP2DEL_PDC                  188
#define P2DC1                         189
#define ECCP2DEL_PDC1                 190
#define P2DC2                         191
#define ECCP2DEL_PDC2                 192
#define P2DC3                         193
#define ECCP2DEL_PDC3                 194
#define P2DC4                         195
#define ECCP2DEL_PDC4                 196
#define P2DC5                         197
#define ECCP2DEL_PDC5                 198
#define P2DC6                         199
#define ECCP2DEL_PDC6                 200
#define ECCP2DEL_PRSEN                201
#define P2RSEN                        202
#define ECCP2AS                       203
#define ECCP2AS_PSSBD                 204
#define ECCP2AS_PSSBD0                205
#define PSS2BD0                       206
#define ECCP2AS_PSSBD1                207
#define PSS2BD1                       208
#define PSS2AC0                       209
#define ECCP2AS_PSSAC0                210
#define ECCP2AS_PSSAC                 211
#define ECCP2AS_PSSAC1                212
#define PSS2AC1                       213
#define ECCP2AS_ECCPAS                214
#define ECCP2AS0                      215
#define ECCP2AS_ECCPAS0               216
#define ECCP2AS1                      217
#define ECCP2AS_ECCPAS1               218
#define ECCP2AS2                      219
#define ECCP2AS_ECCPAS2               220
#define ECCP2AS_ECCPASE               221
#define ECCP2ASE                      222
#define ECCP3DEL                      223
#define ECCP3DEL_PDC0                 224
#define P3DC0                         225
#define ECCP3DEL_PDC                  226
#define ECCP3DEL_PDC1                 227
#define P3DC1                         228
#define ECCP3DEL_PDC2                 229
#define P3DC2                         230
#define ECCP3DEL_PDC3                 231
#define P3DC3                         232
#define ECCP3DEL_PDC4                 233
#define P3DC4                         234
#define ECCP3DEL_PDC5                 235
#define P3DC5                         236
#define ECCP3DEL_PDC6                 237
#define P3DC6                         238
#define P3RSEN                        239
#define ECCP3DEL_PRSEN                240
#define ECCP3AS                       241
#define ECCP3AS_PSSBD0                242
#define PSS3BD0                       243
#define ECCP3AS_PSSBD                 244
#define ECCP3AS_PSSBD1                245
#define PSS3BD1                       246
#define ECCP3AS_PSSAC0                247
#define PSS3AC0                       248
#define ECCP3AS_PSSAC                 249
#define ECCP3AS_PSSAC1                250
#define PSS3AC1                       251
#define ECCP3AS_ECCPAS0               252
#define ECCP3AS_ECCPAS                253
#define ECCP3AS0                      254
#define ECCP3AS_ECCPAS1               255
#define ECCP3AS1                      256
#define ECCP3AS_ECCPAS2               257
#define ECCP3AS2                      258
#define ECCP3AS_ECCPASE               259
#define ECCP3ASE                      260
#define RCSTA2                        261
#define RCD82                         262
#define RX9D2                         263
#define RCSTA2_RCD8                   264
#define RCSTA2_RX9D                   265
#define RCSTA2_OERR                   266
#define OERR2                         267
#define FERR2                         268
#define RCSTA2_FERR                   269
#define ADDEN2                        270
#define RCSTA2_ADDEN                  271
#define RCSTA2_CREN                   272
#define CREN2                         273
#define SREN2                         274
#define RCSTA2_SREN                   275
#define RC92                          276
#define RCSTA2_nRC8                   277
#define RC8_92                        278
#define RCSTA2_RX9                    279
#define RCSTA2_NOT_RC8                280
#define RCSTA2_RC9                    281
#define RCSTA2_RC8_9                  282
#define RX92                          283
#define RCSTA2_SPEN                   284
#define SPEN2                         285
#define TXSTA2                        286
#define TXSTA2_TXD8                   287
#define TX9D2                         288
#define TXSTA2_TX9D                   289
#define TXD82                         290
#define TRMT2                         291
#define TXSTA2_TRMT                   292
#define BRGH2                         293
#define TXSTA2_BRGH                   294
#define SENDB2                        295
#define TXSTA2_SENDB                  296
#define TXSTA2_SYNC                   297
#define SYNC2                         298
#define TXEN2                         299
#define TXSTA2_TXEN                   300
#define TX8_92                        301
#define TX92                          302
#define TXSTA2_TX9                    303
#define TXSTA2_nTX8                   304
#define TXSTA2_NOT_TX8                305
#define TXSTA2_TX8_9                  306
#define TXSTA2_CSRC                   307
#define CSRC2                         308
#define CCP5CON                       309
#define CCP5M0                        310
#define CCP5M                         311
#define CCP5M1                        312
#define CCP5M2                        313
#define CCP5M3                        314
#define CCP5Y                         315
#define DC5B0                         316
#define DC5B                          317
#define CCP5X                         318
#define DC5B1                         319
#define CCP4CON                       320
#define CCP4M                         321
#define CCP4M0                        322
#define CCP4M1                        323
#define CCP4M2                        324
#define CCP4M3                        325
#define CCP4Y                         326
#define DC4B0                         327
#define DC4B                          328
#define CCP4X                         329
#define DC4B1                         330
#define T4CON                         331
#define T4CKPS0                       332
#define T4CKPS                        333
#define T4CKPS1                       334
#define TMR4ON                        335
#define T4OUTPS                       336
#define T4OUTPS0                      337
#define T4OUTPS1                      338
#define T4OUTPS2                      339
#define T4OUTPS3                      340
#define ECCP1DEL                      341
#define P1DC0                         342
#define ECCP1DEL_PDC0                 343
#define ECCP1DEL_PDC                  344
#define P1DC1                         345
#define ECCP1DEL_PDC1                 346
#define P1DC2                         347
#define ECCP1DEL_PDC2                 348
#define P1DC3                         349
#define ECCP1DEL_PDC3                 350
#define P1DC4                         351
#define ECCP1DEL_PDC4                 352
#define P1DC5                         353
#define ECCP1DEL_PDC5                 354
#define P1DC6                         355
#define ECCP1DEL_PDC6                 356
#define P1RSEN                        357
#define ECCP1DEL_PRSEN                358
#define BAUDCON2                      359
#define ABDEN2                        360
#define BAUDCON2_ABDEN                361
#define WUE2                          362
#define BAUDCON2_WUE                  363
#define BRG162                        364
#define BAUDCON2_BRG16                365
#define BAUDCON2_SCKP                 366
#define SCKP2                         367
#define TXCKP2                        368
#define BAUDCON2_TXCKP                369
#define DTRXP2                        370
#define RXDTP2                        371
#define BAUDCON2_RXDTP                372
#define RCMT2                         373
#define RCIDL2                        374
#define BAUDCON2_RCIDL                375
#define BAUDCON2_RCMT                 376
#define BAUDCON2_ABDOVF               377
#define ABDOVF2                       378
#define BAUDCON1                      379
#define BAUDCON1_ABDEN                380
#define ABDEN1                        381
#define BAUDCON1_WUE                  382
#define WUE1                          383
#define W4E                           384
#define BRG161                        385
#define BAUDCON1_BRG16                386
#define CKTXP                         387
#define BAUDCON1_TXCKP                388
#define SCKP1                         389
#define BAUDCON1_SCKP                 390
#define TXCKP1                        391
#define DTRXP1                        392
#define RXDTP1                        393
#define DTRXP                         394
#define RXCKP                         395
#define BAUDCON1_RXDTP                396
#define BAUDCON1_RCMT                 397
#define RCMT1                         398
#define RCIDL1                        399
#define BAUDCON1_RCIDL                400
#define ABDOVF1                       401
#define BAUDCON1_ABDOVF               402
#define PORTA                         403
#define ULPWUIN                       404
#define AN0                           405
#define PORTA_RA0                     406
#define LEDA                          407
#define AN1                           408
#define PORTA_RA1                     409
#define LEDB                          410
#define AN2                           411
#define PORTA_RA2                     412
#define VREFM                         413
#define AN3                           414
#define PORTA_RA3                     415
#define VREFP                         416
#define PORTA_RA4                     417
#define T0CKI                         418
#define AN4                           419
#define PORTA_RA5                     420
#define LVDIN                         421
#define PORTA_RJPU                    422
#define RA7                           423
#define PORTB                         424
#define FLT0                          425
#define INT0                          426
#define PORTB_RB0                     427
#define INT1                          428
#define PORTB_RB1                     429
#define INT2                          430
#define PORTB_RB2                     431
#define INT3                          432
#define CCP2_PA2                      433
#define PORTB_CCP2                    434
#define PORTB_ECCP2                   435
#define PORTB_RB3                     436
#define KBI0                          437
#define PORTB_RB4                     438
#define KBI1                          439
#define PORTB_RB5                     440
#define PGC                           441
#define KBI2                          442
#define PORTB_RB6                     443
#define PGD                           444
#define KBI3                          445
#define PORTB_RB7                     446
#define PORTC                         447
#define T13CKI                        448
#define T1OSO                         449
#define PORTC_RC0                     450
#define PORTC_ECCP2                   451
#define PORTC_CCP2                    452
#define T1OSI                         453
#define PA2                           454
#define PORTC_RC1                     455
#define CCP1                          456
#define ECCP1                         457
#define PA1                           458
#define PORTC_RC2                     459
#define SCK1                          460
#define SCL                           461
#define SCL1                          462
#define SCK                           463
#define PORTC_RC3                     464
#define SDI1                          465
#define SDA1                          466
#define SDA                           467
#define SDI                           468
#define PORTC_RC4                     469
#define SDO1                          470
#define SDO                           471
#define PORTC_RC5                     472
#define TX                            473
#define PORTC_RC6                     474
#define CK                            475
#define TX1                           476
#define CK1                           477
#define DT                            478
#define RX                            479
#define RX1                           480
#define DT1                           481
#define PORTC_RC7                     482
#define PORTD                         483
#define PSP0                          484
#define PORTD_RD0                     485
#define AD0                           486
#define PSP1                          487
#define PORTD_RD1                     488
#define AD1                           489
#define PSP2                          490
#define AD2                           491
#define PORTD_RD2                     492
#define PSP3                          493
#define AD3                           494
#define PORTD_RD3                     495
#define PORTD_RD4                     496
#define PSP4                          497
#define AD4                           498
#define SDO2                          499
#define PSP5                          500
#define SDI2                          501
#define AD5                           502
#define SDA2                          503
#define PORTD_RD5                     504
#define SCK2                          505
#define PSP6                          506
#define AD6                           507
#define SCL2                          508
#define PORTD_RD6                     509
#define SS2                           510
#define PSP7                          511
#define NOT_SS2                       512
#define nSS2                          513
#define AD7                           514
#define PORTD_RD7                     515
#define PORTE                         516
#define NOT_RD                        517
#define nRD                           518
#define PD2                           519
#define AD8                           520
#define RD                            521
