tiborsimon/embedded-tdd-headers/pic/8bit/pic18f96j65_tdd.h
#define RCSTA1_NOT_RC8                1091
#define RCSTA1_RC9                    1092
#define RCSTA1_nRC8                   1093
#define RCSTA1_RC8_9                  1094
#define RCSTA1_RX9                    1095
#define RX91                          1096
#define RCSTA1_SPEN                   1097
#define SPEN1                         1098
#define TXSTA1                        1099
#define TX9D1                         1100
#define TXSTA1_TX9D                   1101
#define TXSTA1_TXD8                   1102
#define TRMT1                         1103
#define TXSTA1_TRMT                   1104
#define BRGH1                         1105
#define TXSTA1_BRGH                   1106
#define TXSTA1_SENDB                  1107
#define SENDB1                        1108
#define TXSTA1_SYNC                   1109
#define SYNC1                         1110
#define TXEN1                         1111
#define TXSTA1_TXEN                   1112
#define TX91                          1113
#define TXSTA1_NOT_TX8                1114
#define TXSTA1_TX8_9                  1115
#define TXSTA1_TX9                    1116
#define TXSTA1_nTX8                   1117
#define TXSTA1_CSRC                   1118
#define CSRC1                         1119
#define PSPCON                        1120
#define PSPMODE                       1121
#define IBOV                          1122
#define OBF                           1123
#define IBF                           1124
#define T3CON                         1125
#define TMR3ON                        1126
#define TMR3CS                        1127
#define nT3SYNC                       1128
#define NOT_T3SYNC                    1129
#define T3SYNC                        1130
#define T3INSYNC                      1131
#define SOSCEN3                       1132
#define T3CCP1                        1133
#define T3CKPS                        1134
#define T3CKPS0                       1135
#define T3CKPS1                       1136
#define T3CCP2                        1137
#define T3CON_RD16                    1138
#define RD163                         1139
#define T3RD16                        1140
#define CMCON                         1141
#define CMCON_CM                      1142
#define CMEN0                         1143
#define CM0                           1144
#define CMEN1                         1145
#define CM1                           1146
#define CMEN2                         1147
#define CM2                           1148
#define CIS                           1149
#define C1INV                         1150
#define C2INV                         1151
#define C1OUT                         1152
#define C2OUT                         1153
#define CVRCON                        1154
#define CVR                           1155
#define CVR0                          1156
#define CVR1                          1157
#define CVR2                          1158
#define CVR3                          1159
#define CVRSS                         1160
#define CVRR                          1161
#define CVROEN                        1162
#define CVROE                         1163
#define CVREN                         1164
#define ECCP1AS                       1165
#define ECCP1AS_PSSBD                 1166
#define ECCP1AS_PSSBD0                1167
#define PSS1BD0                       1168
#define ECCP1AS_PSSBD1                1169
#define PSS1BD1                       1170
#define ECCP1AS_PSSAC0                1171
#define PSS1AC0                       1172
#define ECCP1AS_PSSAC                 1173
#define ECCP1AS_PSSAC1                1174
#define PSS1AC1                       1175
#define ECCP1AS_ECCPAS0               1176
#define ECCP1AS_ECCPAS                1177
#define ECCP1AS0                      1178
#define ECCP1AS_ECCPAS1               1179
#define ECCP1AS1                      1180
#define ECCP1AS_ECCPAS2               1181
#define ECCP1AS2                      1182
#define ECCP1ASE                      1183
#define ECCP1AS_ECCPASE               1184
#define CCP3CON                       1185
#define CCP3M                         1186
#define CCP3M0                        1187
#define CCP3M1                        1188
#define CCP3M2                        1189
#define CCP3M3                        1190
#define CCP3Y                         1191
#define DC3B                          1192
#define DC3B0                         1193
#define DC3B1                         1194
#define CCP3X                         1195
#define P3M                           1196
#define P3M0                          1197
#define P3M1                          1198
#define CCP2CON                       1199
#define CCP2M                         1200
#define CCP2M0                        1201
#define CCP2M1                        1202
#define CCP2M2                        1203
#define CCP2M3                        1204
#define DC2B                          1205
#define DC2B0                         1206
#define CCP2Y                         1207
#define DC2B1                         1208
#define CCP2X                         1209
#define P2M                           1210
#define P2M0                          1211
#define P2M1                          1212
#define CCP1CON                       1213
#define CCP1M0                        1214
#define CCP1M                         1215
#define CCP1M1                        1216
#define CCP1M2                        1217
#define CCP1M3                        1218
#define CCP1Y                         1219
#define DC1B                          1220
#define DC1B0                         1221
#define CCP1X                         1222
#define DC1B1                         1223
#define P1M                           1224
#define P1M0                          1225
#define P1M1                          1226
#define ADCON2                        1227
#define ADCS0                         1228
#define ADCS                          1229
#define ADCS1                         1230
#define ADCS2                         1231
#define ACQT0                         1232
#define ACQT                          1233
#define ACQT1                         1234
#define ACQT2                         1235
#define ADFM                          1236
#define ADCON1                        1237
#define PCFG0                         1238
#define PCFG                          1239
#define PCFG1                         1240
#define PCFG2                         1241
#define CHSN3                         1242
#define PCFG3                         1243
#define VCFG                          1244
#define VCFG0                         1245
#define VCFG01                        1246
#define VCFG11                        1247
#define VCFG1                         1248
#define ADCON0                        1249
#define ADON                          1250
#define nDONE                         1251
#define GO_nDONE                      1252
#define NOT_DONE                      1253
#define GODONE                        1254
#define GO_DONE                       1255
#define DONE                          1256
#define GO_NOT_DONE                   1257
#define GO                            1258
#define CHS0                          1259
#define CHS                           1260
#define CHS1                          1261
#define CHS2                          1262
#define CHS3                          1263
#define ADCAL                         1264
#define SSP1CON2                      1265
#define SEN1                          1266
#define SSP1CON2_SEN                  1267
#define ADMSK11                       1268
#define SSP1CON2_RSEN                 1269
#define RSEN1                         1270
#define SSP1CON2_ADMSK1               1271
#define SSP1CON2_ADMSK                1272
#define SSP1CON2_PEN                  1273
#define ADMSK21                       1274
#define PEN1                          1275
#define SSP1CON2_ADMSK2               1276
#define ADMSK31                       1277
#define RCEN1                         1278
#define SSP1CON2_RCEN                 1279
#define SSP1CON2_ADMSK3               1280
#define SSP1CON2_ACKEN                1281
#define ACKEN1                        1282
#define ADMSK41                       1283
#define SSP1CON2_ADMSK4               1284
#define ACKDT1                        1285
#define ADMSK51                       1286
#define SSP1CON2_ACKDT                1287
#define SSP1CON2_ADMSK5               1288
#define SSP1CON2_ACKSTAT              1289
#define ACKSTAT1                      1290
#define GCEN1                         1291
#define SSP1CON2_GCEN                 1292
#define SSP1CON1                      1293
#define SSP1CON1_SSPM0                1294
#define SSPM01                        1295
#define SSP1CON1_SSPM                 1296
#define SSP1CON1_SSPM1                1297
#define SSPM11                        1298
#define SSP1CON1_SSPM2                1299
#define SSPM21                        1300
#define SSPM31                        1301
#define SSP1CON1_SSPM3                1302
#define SSP1CON1_CKP                  1303
#define CKP1                          1304
#define SSPEN1                        1305
#define SSP1CON1_SSPEN                1306
#define SSPOV1                        1307
#define SSP1CON1_SSPOV                1308
#define WCOL1                         1309
#define SSP1CON1_WCOL                 1310
#define SSP1STAT                      1311
#define BF1                           1312
#define SSP1STAT_BF                   1313
#define UA1                           1314
#define SSP1STAT_UA                   1315
#define SSP1STAT_R_NOT_W              1316
#define RW1                           1317
#define NOT_W                         1318
#define SSP1STAT_R                    1319
#define SSP1STAT_nW                   1320
#define RW                            1321
#define SSP1STAT_READ_WRITE           1322
#define SSP1STAT_nWRITE               1323
#define SSP1STAT_I2C_READ             1324
#define SSP1STAT_R_W                  1325
#define SSP1STAT_NOT_WRITE            1326
#define SSP1STAT_R_nW                 1327
#define SSP1STAT_S                    1328
#define START                         1329
#define START1                        1330
#define SSP1STAT_I2C_START            1331
#define STOP                          1332
#define SSP1STAT_P                    1333
#define STOP1                         1334
#define SSP1STAT_I2C_STOP             1335
#define SSP1STAT_D                    1336
#define SSP1STAT_D_NOT_A              1337
#define NOT_A                         1338
#define SSP1STAT_D_A                  1339
#define SSP1STAT_D_nA                 1340
#define SSP1STAT_NOT_ADDRESS          1341
#define SSP1STAT_nA                   1342
#define DA1                           1343
#define DA                            1344
#define SSP1STAT_nADDRESS             1345
#define SSP1STAT_I2C_DAT              1346
#define SSP1STAT_DATA_ADDRESS         1347
#define SSP1STAT_CKE                  1348
#define CKE1                          1349
#define SSP1STAT_SMP                  1350
#define SMP1                          1351
#define SSP1ADD                       1352
#define MSK01                         1353
#define MSK0                          1354
#define MSK11                         1355
#define MSK1                          1356
#define MSK21                         1357
#define MSK2                          1358
#define MSK3                          1359
#define MSK31                         1360
#define MSK4                          1361
#define MSK41                         1362
#define MSK51                         1363
#define MSK5                          1364
#define MSK61                         1365
#define MSK6                          1366
#define MSK71                         1367
#define MSK7                          1368
#define T2CON                         1369
#define T2CKPS0                       1370
#define T2CKPS                        1371
#define T2CKPS1                       1372
#define TMR2ON                        1373
#define T2OUTPS0                      1374
#define TOUTPS                        1375
#define T2OUTPS1                      1376
#define T2OUTPS2                      1377
#define T2OUTPS3                      1378
#define T1CON                         1379
#define TMR1ON                        1380
#define TMR1CS                        1381
#define NOT_T1SYNC                    1382
#define T1SYNC                        1383
#define nT1SYNC                       1384
#define T1INSYNC                      1385
#define T1OSCEN                       1386
#define SOSCEN                        1387
#define T1CKPS0                       1388
#define T1CKPS                        1389
#define T1CKPS1                       1390
#define T1RUN                         1391
#define T1RD16                        1392
#define T1CON_RD16                    1393
#define RCON                          1394
#define BOR                           1395
#define NOT_BOR                       1396
#define nBOR                          1397
#define POR                           1398
#define nPOR                          1399
#define NOT_POR                       1400
#define PD                            1401
#define nPD                           1402
#define NOT_PD                        1403
#define nTO                           1404
#define TO                            1405
#define NOT_TO                        1406
#define nRI                           1407
#define NOT_RI                        1408
#define RI                            1409
#define NOT_CM                        1410
#define RCON_CM                       1411
#define nCM                           1412
#define IPEN                          1413
#define WDTCON                        1414
#define SWDTE                         1415
#define SWDTEN                        1416
#define ECON1                         1417
#define RXEN                          1418
#define TXRTS                         1419
#define CSUMEN                        1420
#define DMAST                         1421
#define RXRST                         1422
#define TXRST                         1423
#define OSCCON                        1424
#define SCS0                          1425
#define SCS                           1426
#define SCS1                          1427
#define OSTS                          1428
#define IDLEN                         1429
#define T0CON                         1430
#define T0PS                          1431
#define T0PS0                         1432
#define T0PS1                         1433
#define T0PS2                         1434
#define PSA                           1435
#define T0SE                          1436
#define T0CS                          1437
#define T08BIT                        1438
#define TMR0ON                        1439
#define STATUS                        1440
#define C                             1441
#define CARRY                         1442
#define DC                            1443
#define ZERO                          1444
#define Z                             1445
#define OV                            1446
#define OVERFLOW                      1447
#define N                             1448
#define NEGATIVE                      1449
#define INTCON3                       1450
#define INT1IF                        1451
#define INT1F                         1452
#define INT2IF                        1453
#define INT2F                         1454
#define INT3F                         1455
#define INT3IF                        1456
#define INT1E                         1457
#define INT1IE                        1458
#define INT2IE                        1459
#define INT2E                         1460
#define INT3E                         1461
#define INT3IE                        1462
#define INT1P                         1463
#define INT1IP                        1464
#define INT2IP                        1465
#define INT2P                         1466
#define INTCON2                       1467
#define RBIP                          1468
#define INT3IP                        1469
#define TMR0IP                        1470
#define T0IP                          1471
#define INTEDG3                       1472
#define INTEDG2                       1473
#define INTEDG1                       1474
#define INTEDG0                       1475
#define RBPU                          1476
#define NOT_RBPU                      1477
#define nRBPU                         1478
#define INTCON                        1479
#define RBIF                          1480
#define INT0F                         1481
#define INT0IF                        1482
#define T0IF                          1483
#define TMR0IF                        1484
#define RBIE                          1485
#define INT0E                         1486
#define INT0IE                        1487
#define T0IE                          1488
#define TMR0IE                        1489
#define PEIE                          1490
#define PEIE_GIEL                     1491
#define GIEL                          1492
#define GIE_GIEH                      1493
#define GIE                           1494
#define GIEH                          1495
#define STKPTR0                       1496
#define STKPTR                        1497
#define SP0                           1498
#define STKPTR1                       1499
#define SP1                           1500
#define STKPTR2                       1501
#define SP2                           1502
#define SP3                           1503
#define STKPTR3                       1504
#define STKPTR4                       1505
#define SP4                           1506
#define STKUNF                        1507
#define STKOVF                        1508
#define STKFUL                        1509

#endif // _PIC18F96J65_H_
